Revit 2024 API
AssetSet.Erase Method
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual int Erase(
	Asset item
)
Visual Basic
Public Overridable Function Erase ( _
	item As Asset _
) As Integer
Visual C++
public:
virtual int Erase(
	Asset^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Visual.Asset
See Also
AssetSet Class
Autodesk.Revit.DB.Visual Namespace